docs/build-log/comms-matrix-1/consent-search-contract-mutation.diff
--- a/mcp/tests/search-param-contract.ts
+++ b/mcp/tests/search-param-contract.ts
@@ -22,7 +22,6 @@
   ClaimResponse: "_content _count _id _lastUpdated _profile _query _security _sort _source _tag _text created disposition identifier insurer outcome patient payment-date request requestor status use".split(" "),
   Communication: "_content _count _id _lastUpdated _profile _query _security _sort _source _tag _text based-on category encounter identifier instantiates-canonical instantiates-uri medium part-of patient priority priority-order received recipient sender sent status subject topic".split(" "),
   Condition: "_content _count _id _lastUpdated _profile _query _security _sort _source _tag _text abatement-age abatement-date abatement-string asserted-date asserter body-site category clinical-status code encounter evidence evidence-detail identifier onset-age onset-date onset-info patient recorded-date severity stage subject verification-status".split(" "),
-  Consent: "_content _count _id _lastUpdated _profile _query _security _sort _source _tag _text action actor category consentor data date identifier organization patient period purpose scope security-label source-reference status".split(" "),
   Coverage: "_content _count _id _lastUpdated _profile _query _security _sort _source _tag _text beneficiary class-type class-value dependent identifier patient payor policy-holder status subscriber type".split(" "),
   DiagnosticReport: "_content _count _id _lastUpdated _profile _query _security _sort _source _tag _text based-on category code conclusion date encounter identifier issued media patient performer result results-interpreter specimen status study subject".split(" "),
   DocumentReference: "_content _count _id _lastUpdated _profile _query _security _sort _source _tag _text authenticator author category contenttype custodian date description encounter event facility format identifier language location patient period related relatesto relation relationship security-label setting status subject type".split(" "),
